# Task 02 - Track A: Working with DataFrames

**Course:** Database Applications Development  
**Lesson:** 02 - Working with DataFrames (Preparing for SQL)  

---

## Instructions

Complete all exercises in this notebook. Each section includes example code to help guide you.

**Submission:**
1. Save this notebook as `dbAppsTask02TrackA.ipynb`
2. Add, commit, and push to your `databaseApplications` repository on GitHub
3. Verify the file appears correctly on GitHub

---

## Setup: Load the Dataset

In [1]:
# Import pandas and load data
import pandas as pd

titanic = pd.read_csv('Titanic Dataset.csv')

# Quick check
print(titanic.shape)
titanic.head()

(1309, 14)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

---

## Part 1: Selecting Columns

### Example: Select a Single Column

In [2]:
# Select one column (returns a Series)
names = titanic['name']

# Display first 10 values
print(names.head(10))

# This gets just the 'name' column from the titanic DataFrame

0                      Allen, Miss. Elisabeth Walton
1                     Allison, Master. Hudson Trevor
2                       Allison, Miss. Helen Loraine
3               Allison, Mr. Hudson Joshua Creighton
4    Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
5                                Anderson, Mr. Harry
6                  Andrews, Miss. Kornelia Theodosia
7                             Andrews, Mr. Thomas Jr
8      Appleton, Mrs. Edward Dale (Charlotte Lamson)
9                            Artagaveytia, Mr. Ramon
Name: name, dtype: object

### Exercise 1.1: Select Single Columns

Select and display the first 10 values:
1. The 'age' column
2. The 'fare' column

In [6]:
# Age column

age = titanic['age']
print(age.head(10))

0      29
1    0.92
2       2
3      30
4      25
5      48
6      63
7      39
8      53
9      71
Name: age, dtype: object

In [8]:
# Fare column
fare = titanic['fare']
print(fare.head(10))

0    211.3375
1    151.5500
2    151.5500
3    151.5500
4    151.5500
5     26.5500
6     77.9583
7      0.0000
8     51.4792
9     49.5042
Name: fare, dtype: float64

### Example: Select Multiple Columns

In [9]:
# Select multiple columns (note the double brackets)
subset = titanic[['name', 'age', 'sex']]

# Display first 5 rows
print(subset.head())

# The outer brackets mean 'select from titanic'
# The inner brackets are a list of column names

                                              name   age     sex
0                    Allen, Miss. Elisabeth Walton    29  female
1                   Allison, Master. Hudson Trevor  0.92    male
2                     Allison, Miss. Helen Loraine     2  female
3             Allison, Mr. Hudson Joshua Creighton    30    male
4  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)    25  female

### Exercise 1.2: Select Multiple Columns

Create a DataFrame called `passenger_info` with these columns: 'name', 'sex', 'age', 'survived'

Display the first 10 rows.

In [11]:
# Your code here
passenger_info = titanic [['name', 'sex', 'age', 'survived']]
print(passenger_info.head(10))

                                              name     sex   age  survived
0                    Allen, Miss. Elisabeth Walton  female    29         1
1                   Allison, Master. Hudson Trevor    male  0.92         1
2                     Allison, Miss. Helen Loraine  female     2         0
3             Allison, Mr. Hudson Joshua Creighton    male    30         0
4  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  female    25         0
5                              Anderson, Mr. Harry    male    48         1
6                Andrews, Miss. Kornelia Theodosia  female    63         1
7                           Andrews, Mr. Thomas Jr    male    39         0
8    Appleton, Mrs. Edward Dale (Charlotte Lamson)  female    53         1
9                          Artagaveytia, Mr. Ramon    male    71         0

---

## Part 2: Filtering Rows

### Example: Basic Filtering

In [ ]:
# Filter to get only first class passengers
first_class = titanic[titanic['pclass'] == 1]

# Count how many
print(f"First class passengers: {len(first_class)}")

# Display first few
print(first_class[['name', 'pclass', 'fare']].head())

# The condition titanic['pclass'] == 1 creates True/False for each row
# The brackets filter to keep only True rows

### Exercise 2.1: Filter by Survival

Create a DataFrame called `survivors` with only passengers who survived.

Print how many survivors there were.

In [15]:
# Your code here
survivors = titanic[titanic['survived'] == 1]

print(f"Number of people who survived: {len(survivors)}")

print(survivors[['name', 'pclass', 'fare']].head())

Number of people who survived: 500
                                            name  pclass      fare
0                  Allen, Miss. Elisabeth Walton       1  211.3375
1                 Allison, Master. Hudson Trevor       1  151.5500
5                            Anderson, Mr. Harry       1   26.5500
6              Andrews, Miss. Kornelia Theodosia       1   77.9583
8  Appleton, Mrs. Edward Dale (Charlotte Lamson)       1   51.4792

### Exercise 2.2: Filter by Gender

Create a DataFrame called `females` with only female passengers.

Print how many there were.

In [17]:
# Your code here
females = titanic[titanic['sex'] == "female"]
print(f"Number of female passangers: {len(females)}")
print(females[['name', 'pclass', 'fare']].head())

Number of female passangers: 466
                                              name  pclass      fare
0                    Allen, Miss. Elisabeth Walton       1  211.3375
2                     Allison, Miss. Helen Loraine       1  151.5500
4  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)       1  151.5500
6                Andrews, Miss. Kornelia Theodosia       1   77.9583
8    Appleton, Mrs. Edward Dale (Charlotte Lamson)       1   51.4792

### Exercise 2.3: Filter by Class

Create a DataFrame called `first_class` with only first class passengers.

Print how many there were.

In [19]:
# Your code here
first_class = titanic[titanic['pclass'] == 1]
print(f"Number of first class passangers: {len(first_class)}")
print(first_class[['name', 'pclass', 'fare']].head())

Number of first class passangers: 323
                                              name  pclass      fare
0                    Allen, Miss. Elisabeth Walton       1  211.3375
1                   Allison, Master. Hudson Trevor       1  151.5500
2                     Allison, Miss. Helen Loraine       1  151.5500
3             Allison, Mr. Hudson Joshua Creighton       1  151.5500
4  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)       1  151.5500

### Exercise 2.4: Filter by Age

Create a DataFrame called `children` with passengers 12 or younger.

Print how many there were.

In [30]:
titanic['age'] = pd.to_numeric(titanic['age'], errors='coerce')

In [31]:
# Your code here
children = titanic[titanic['age'] >= 13]
print(f"Number of children passangers: {len(children)}")
print(children[['name', 'pclass', 'fare']].head())

Number of children passangers: 952
                                              name  pclass      fare
0                    Allen, Miss. Elisabeth Walton       1  211.3375
3             Allison, Mr. Hudson Joshua Creighton       1  151.5500
4  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)       1  151.5500
5                              Anderson, Mr. Harry       1   26.5500
6                Andrews, Miss. Kornelia Theodosia       1   77.9583

---

## Part 3: Sorting Data

### Example: Sort by Column

In [ ]:
# Sort by age (youngest first - ascending is default)
sorted_by_age = titanic.sort_values('age')

# Display name and age for first 10
print(sorted_by_age[['name', 'age']].head(10))

# For descending (oldest first), use ascending=False
sorted_desc = titanic.sort_values('age', ascending=False)

### Exercise 3.1: Sort by Age

Sort passengers by age and display name and age for the 10 youngest.

In [32]:
# Your code here
sorted_by_age = titanic.sort_values('age')
print(sorted_by_age[['name', 'age']].head(10))

                                         name   age
763   Dean, Miss. Elizabeth Gladys "Millvina"  0.17
747   Danbom, Master. Gilbert Sigvard Emanuel  0.33
1240          Thomas, Master. Assad Alexander  0.42
427                 Hamalainen, Master. Viljo  0.67
658             Baclini, Miss. Helene Barbara  0.75
657                    Baclini, Miss. Eugenie  0.75
1111           Peacock, Master. Alfred Edward  0.75
611                 Aks, Master. Philip Frank  0.83
359             Caldwell, Master. Alden Gates  0.83
548           Richards, Master. George Sibley  0.83

### Exercise 3.2: Sort by Fare

Sort passengers by fare (highest first) and display name and fare for the top 10.

In [36]:
# Your code here
sorted_by_fare = titanic.sort_values('fare')
print(sorted_by_fare[['name', 'fare']].head(10))
sorted_desc = titanic.sort_values('fare', ascending=False)

                                       name  fare
1254           Tornquist, Mr. William Henry   0.0
528             Parkes, Mr. Francis "Frank"   0.0
581              Watson, Mr. Ennis Hastings   0.0
473                    Knight, Mr. Robert J   0.0
410        Frost, Mr. Anthony Wood "Archie"   0.0
363                   Campbell, Mr. William   0.0
70    Chisholm, Mr. Roderick Robert Crispin   0.0
384          Cunningham, Mr. Alfred Fleming   0.0
896                     Johnson, Mr. Alfred   0.0
898         Johnson, Mr. William Cahoone Jr   0.0

---

## Part 4: Statistics

### Example: Calculate Statistics

In [ ]:
# Calculate average age of all passengers
avg_age = titanic['age'].mean()
print(f"Average age: {avg_age:.1f} years")

# Find the maximum fare
max_fare = titanic['fare'].max()
print(f"Highest fare: ${max_fare:.2f}")

# Other statistics methods:
# .min() - minimum value
# .max() - maximum value
# .mean() - average
# .median() - middle value
# .sum() - total

### Exercise 4.1: Overall Statistics

Calculate and print:
1. Average age
2. Average fare
3. Maximum fare
4. Minimum age

In [37]:
# Your code here
# Returns count, mean, std, min, 25%, 50%, 75%, and max
print(titanic['age'].describe())

count    1046.000000
mean       29.881138
std        14.413493
min         0.170000
25%        21.000000
50%        28.000000
75%        39.000000
max        80.000000
Name: age, dtype: float64

### Example: Statistics on Filtered Data

In [ ]:
# Filter first, then calculate statistics

# Get all survivors
survivors = titanic[titanic['survived'] == 1]

# Calculate average age of survivors
avg_survivor_age = survivors['age'].mean()
print(f"Average survivor age: {avg_survivor_age:.1f}")

# Or do it in one line:
avg_age = titanic[titanic['survived'] == 1]['age'].mean()

### Exercise 4.2: Statistics on Filtered Data

Calculate:
1. Average age of survivors
2. Average fare of first class passengers

In [ ]:
# Your code here

---

## Part 5: Value Counts

### Example: Count Values

In [ ]:
# Count how many passengers in each class
class_counts = titanic['pclass'].value_counts()
print(class_counts)

# Output shows:
# 3    709  (709 passengers in 3rd class)
# 1    323  (323 passengers in 1st class)
# 2    277  (277 passengers in 2nd class)

# value_counts() shows each unique value and how many times it appears

### Exercise 5.1: Count Values

Use `.value_counts()` to find:
1. How many in each class
2. How many male vs female
3. How many survived vs died

In [ ]:
# Class counts

In [ ]:
# Gender counts

In [ ]:
# Survival counts

---

## Part 6: Analysis Questions

### Question 1: Survival Rate

What percentage of passengers survived?

In [ ]:
# Your code here

**Answer:**

### Question 2: Class Distribution

Which class had the most passengers?

In [ ]:
# Your code here

**Answer:**

### Question 3: Age Comparison

What was the average age of first class vs third class passengers?

In [ ]:
# Your code here

**Answer:**

### Question 4: Gender Distribution

Were there more male or female passengers?

In [ ]:
# Your code here

**Answer:**

### Question 5: Fare Comparison

Did survivors pay more on average than non-survivors?

In [ ]:
# Your code here

**Answer:**

---

## Submission Checklist

- [ ] Completed all exercises
- [ ] Run all cells successfully
- [ ] Added name and date at top
- [ ] Answered all questions
- [ ] Saved as `dbAppsTask02TrackA.ipynb`
- [ ] Pushed to GitHub

**Next lesson: We'll move this data into SQL!**